---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisShadeDepth
source: html/cf6c801c-74db-d072-a9f0-05dbbe5b3d07.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisShadeDepth Property

"Shade Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisShadeDepth { get; }
```